0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            zeroGradient;
    }
    nozzle
    {
        type            zeroGradient;
    }
    outlet_left
    {
        type            totalPressure;
        p0              uniform 0;
    }
    outlet_right
    {    
        // type            waveTransmissive;
        // gamma           1.4;
        // fieldInf        0;
        // lInf            5;
        // value           uniform 0;
        type    totalPressure;
        p0      uniform 0;
    }

    topBottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
