0_org/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    nozzle
    {
        type            zeroGradient;
    }
    outlet_left
    {
        type            zeroGradient;
    }
    outlet_right
    {
        type            zeroGradient;
    }
        topBottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
