system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//fluxScheme      Kurganov;

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    // default         cellLimited Gauss linear 1;

    //default 	    leastSquares;
    //default 	    cellMDLimited Gauss linear 0.5;
    //default 	    cellMDLimited leastSquares 0.5;
    //default 	    cellMDLimited leastSquares 1;

    //grad(U)         cellLimited Gauss linear 1;

    //grad(U)         cellLimited Gauss linear 0.5;
    // grad(p)         cellLimited Gauss linear 0.5;
}

divSchemes
{
    default         none;
    //div(phi,U)      Gauss upwind;
    div(phi,U)      bounded Gauss linearUpwind grad(U);
    // div(phi,U)      Gauss linearUpwind default;
    //div(phi,U)      Gauss limitedLinearV 1;
    //div(phi,U)      Gauss SuperBeeV 1;


//For energy equation
    //div(phi,(p|rho)) Gauss Minmod;	
    // div(phi,(p|rho)) Gauss linearUpwind default;

    //div(phid,p)      Gauss Minmod;
    // div(phid,p)      Gauss linearUpwind default;



//For sensibleInternalEnergy formulation
    //div(phi,K)       Gauss limitedLinear 1;
    //div(phi,e)      Gauss limitedLinear 1;	//Causes div

    //div(phi,K)      Gauss upwind;
    //div(phi,e)      Gauss upwind;

    // div(phi,K)      Gauss linearUpwind default;
    // div(phi,e)      Gauss linearUpwind default;

/*
Block for when solving for sensibleEnthaly equation
//For sensibleEnthalpy formulation
    //div(phi,K)       Gauss limitedLinear 1;
    //div(phi,e)      Gauss limitedLinear 1;	//Causes div

    //div(phi,K)      Gauss upwind;
    //div(phi,e)      Gauss upwind;

    div(phi,K)      Gauss linearUpwind default;
    div(phi,h)      Gauss linearUpwind default;
*/


//For turbulence qunatities
    limitedT         cellLimited Gauss linear 1;
    turbulence1      Gauss upwind;
    turbulence2      Gauss linearUpwind limitedT;
    turbulence3      Gauss limitedLinear 1;
    turbulence4      Gauss Minmod;

    div(phi,k)       $turbulence1;
    div(phi,epsilon) $turbulence1;
    div(phi,nuTilda) $turbulence1;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    // div(grad(rho)) Gauss linear;
    // div(gradient_rho) Gauss linear;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
