system/fvOptions
limitT
{
    type            limitTemperature;
    active          yes;
    
    limitTemperatureCoeffs
    {
        selectionMode   all;
        min             280;
        max             3500;  // Allow combustion temperatures
    }
}