system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 300
    volScalarFieldValue p 101325
    volVectorFieldValue U (10 0 0)
);

regions
(
    zoneToCell
    {
        zone nozzleZone;
        
        fieldValues
        (
            volScalarFieldValue T 300
            volScalarFieldValue p 101325
            volVectorFieldValue U (50 0 0)
        );
    }
);


// ************************************************************************* //
