system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Create cellSet from STL surface
    {
        name    nozzleCells;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file            "constant/geometry/nozzleRegion.stl";
            outsidePoints   ((-0.3 0.42 0.019));  // Point outside the STL
            includeCut      true;       // Don't include cut cells
            includeInside   true;        // Include cells inside
            includeOutside  false;       // Don't include outside cells
            nearDistance    -1;          // Don't use near distance
            curvature       0.9;         // Surface curvature
        }
    }
    
    // Convert cellSet to cellZone for setFields
    {
        name    nozzleZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set nozzleCells;
        }
    }
);
// ************************************************************************* //
